//    '########'########::'######:'########:'##:::'##:
//    ... ##..::##.... ##'##... ##:##.... ##:##::'##::
//    ::: ##::::##:::: ##:##:::..::##:::: ##:##:'##:::
//    ::: ##::::########:. ######::##:::: ##:#####::::
//    ::: ##::::##.... ##:..... ##:##:::: ##:##. ##:::
//    ::: ##::::##:::: ##'##::: ##:##:::: ##:##:. ##::
//    ::: ##::::########:. ######::########::##::. ##:
//    :::..::::........:::......::........::..::::..::
//
//  Created by 亿刀 on 13-2-19.
//  Copyright (c) 2013年 亿刀. All rights reserved.
//

#import <Foundation/Foundation.h>

/** 判断一个MTOP API签名的方式。
 *
 *  MTOP有两种签名方式：登录签名和非登录签名。通过加载本地plist配置文件来判断是哪种签名方式。
 */
@interface TBSDKMTOPRequestSignConfig : NSObject

//! 请将api字符串转换为小写
+ (void)addEcodeSignAPI:(NSArray *)API;

+ (BOOL)needLoginSignForMethod:(NSString *)method;

@end
